samples/soap/nusoap-0.9.5/req.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns3281:TicketCreate xmlns:ns3281="http://ztac.zenatek.eu/otrs/nph-genericinterface.pl/Webservice/GenericTicketConnector"><UserLogin xsi:type="xsd:string">fabio.fazio</UserLogin><Password xsi:type="xsd:string">aaAA11!!</Password><Ticket><Title xsi:type="xsd:string">some title</Title><CustomerUser xsi:type="xsd:string">fmfazio@gmail.com</CustomerUser><Queue xsi:type="xsd:string">ZTAC Incoming Queue</Queue><Type xsi:type="xsd:string">default</Type><State xsi:type="xsd:string">new</State><Priority xsi:type="xsd:string">1 very low</Priority></Ticket><Article><Subject xsi:type="xsd:string">some subject</Subject><Body xsi:type="xsd:string">some body</Body><ContentType xsi:type="xsd:string">text/xml; charset=utf8</ContentType></Article></ns3281:TicketCreate></SOAP-ENV:Body></SOAP-ENV:Envelope>
